/*
* 经目信息。字段顺序依次是：
* sutra_code/sutra_name/due_reel_count/existed_reel_count/start_volume/start_page/end_volume/end_page
* Date: 2019-08-16 08:54
*/

var sutras =[["KB0001", "大般若波羅蜜多經", "581", "1", "KB_1", "1", "KB_2", "21"], ["KB0002", "大寶積", "111", "1", "KB_3", "1", "KB_3", "30"], ["KB0003", "大方等大集經", "43", "1", "KB_4", "1", "KB_4", "36"], ["KB0004", "法華經", "7", "1", "KB_5", "1", "KB_5", "11"], ["KB0005", "阿惟越致遮經", "1", "1", "KB_6", "1", "KB_6", "40"], ["KB0006", "大雲請雨品經", "1", "1", "KB_7", "1", "KB_7", "32"], ["KB0007", "雜阿含經", "39", "1", "KB_8", "1", "KB_9", "5"], ["KB0008", "佛本行集經", "19", "1", "KB_10", "1", "KB_10", "26"], ["KB0009", "十誦律", "46", "1", "KB_11", "1", "KB_11", "55"], ["KB0010", "禦制秘藏詮", "13", "1", "KB_12", "1", "KB_12", "23"]];