/*
* 图片存储结构信息。存储结构有三种模式：藏-函-册-页，藏-经-卷-页，藏-册-页。字段解释如下：
* [[函1,[册1，册2...],[函2,[册1，册2...]]]
* [[经1,[卷1，卷2...],[经2,[卷1，卷2...]]]
* [[册1,[],[册2,[]]]
* Date: 2019-09-22 15:28
*/

var store_pattern ='藏_经_卷_页';
var volumes =[[1, ["1 封面", "2 引", "3 上册", "4 下册"]], [2, ["1 上-封面", "2 上-序言", "3 上-正文", "4 中-封面", "5 中-正文", "6 下-封面", "7 下-正文"]], [3, ["1 上-封面", "2 上-序言", "3 上-正文", "4 中-封面", "5 中-正文", "6 下-封面", "7 下-正文", "8 下-跋+封底"]], [4, ["1 百法问答钞1234-封面", "10 百法问答钞9", "2 百法问答钞1234-前言", "3 百法问答钞1234", "4 百法问答钞56-封面封底", "5 百法问答钞56", "6 百法问答钞7-封面", "7 百法问答钞7", "8 百法问答钞89-封面封底", "9 百法问答钞8"]]];